//  Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

Console.WriteLine("Введите число");
Double i = StringReader;
Console.WriteLine (i);
